Repository: backdrop-contrib/workflow
Catalog: po/*.po
Languages: fr

source: Enables users to manage content using workflow states.
fr: Permet aux utilisateurs de gérer du contenu utilisant les états de flux de travail.

source: You are currently editing the possible transitions to and from a workflow state. The state is shown in the middle column. To the left, check all states that may come before this state. To the right, check all states that may come after this state. For example, you may have a workflow with three states, <em>draft</em>, <em>review</em>, and <em>published</em>. You probably would want the <em>draft</em> state to be able to move to the <em>review</em> state.
fr: Vous éditez actuellement les transitions possibles vers et d'un état de flux de travail. L'état est montré dans la colonne du milieu. Vers la gauche, vérifiez tous les états qui peuvent arriver avant cet état. Vers la droite, vérifiez tous les états qui peuvent arriver après cet état. Par exemple, vous pouvez avoir un flux de travail avec trois états, < em>brouillon</em >, < em>révisé</em >, et < em>publié</em >. Vous voudriez probablement que l'état de < em>brouillon</em > puisse passer à l'état de < em>révisé</em >.

source: To get started, provide a name for your workflow. You might want to give it a name based on the states you will add to the workflow, like <em>Draft-Review-Publish</em> or a name based on its role in your organization, like <em>Sports Column Workflow</em>.
fr: Pour commencer, fournissez un nom pour votre flux de travail. Vous pourriez vouloir lui donner un nom basé sur les états que vous ajouterez au flux de travail, comme <em>Brouillon-Révisé-Publié</em > ou un nom basé sur son rôle dans votre organisation, comme <em>Flux de colonne de Sports</em>.

source: Enter the name for a state in your workflow. For example, if you were doing a meal workflow it may include states like <em>shop</em>, <em>prepare food</em>, <em>eat</em>, and <em>clean up</em>.
fr: Écriver le nom pour un état dans votre flux de travail. Par exemple, si vous faisiez un flux de travail pour un repas il peut comporter des états comme < em>magasin</em >, < em>préparer le repas</em >, < em>manger</em >, et <em>nettoyer</em>.

source: Each node type may have a separate workflow. Use this page to associate node types with the workflow you want them to use.
fr: Chaque type de noeud peut avoir un flux de travail séparé. Utisez cette page pour associer des types de noeud au flux de travail que vous voulez qu'ils utilisent.

source: Use this page to set actions to happen when transitions occur. To configure actions, use the actions module.
fr: Utilisez cette page pour mettre des actions qui devront se produire quand les transitions arrivent. Pour configurer des actions, utilisez le module actions.

source: workflow
fr: flux de travail

source: list
fr: liste

source: add workflow
fr: Ajouter flux de travail

source: type mapping
fr: Mise en correspondance de type

source: Workflow
fr: Flux de travail

source: The workflow state is invalid for this node type. Check workflow settings.
fr: L'état de flux de travail est invalide pour ce type de noeud. Vérifier les paramètres de flux de travail.

source: Workflow name updated to
fr: Nom du flux de travail mise à jour à

source: Allowable transitions for
fr: Autorise des transitions pour

source: were saved.
fr: a été sauvegardé.

source: The workflow
fr: Le flux de travail

source: was deleted.
fr: a été supprimé.

source: The workflow mapping was saved.
fr: La mise en relation du flux de travail a été sauvegardée.

source: The action
fr: L'opération

source: has been removed.
fr: a été enlevé.

source: Name
fr: Nom

source: add state
fr: ajouter état

source: actions
fr: activités

source: edit
fr: Editer

source: delete
fr: supprimer

source: No workflows have been added. Would you like to
fr: Pas de flux de travail ajouté. Voudriez-vous le faire

source: add a workflow
fr: ajouter un flux de travail

source: Add Workflow
fr: Ajouter flux de travail

source: Save
fr: Sauvegarder

source: Confirm deletion
fr: Confirmer la suppression

source: Really delete workflow
fr: Supprimer réellement le flux de travail

source: and all the states it contains
fr: et tous les états qu'il contient

source: All nodes that have a workflow state associated with this workflow will have those workflow states removed.
fr: Tous les noeuds qui ont un état de flux de travail lié à ce flux de travail auront ces états de flux de travail enlevés.

source: Delete
fr: Supprimer

source: (creation)
fr: (création)

source: Really delete workflow state
fr: Supprimer réellement l'état de flux de travail

source: (and all its transitions)
fr: (et toutes ses transitions)

source: States that may move to state
fr: Les états peuvent-être déplacés vers cet état

source: States that state
fr: Déclarer cet état

source: may move to
fr: doit se déplacer vers

source: Save Transitions
fr: Sauvegarder les transitions

source: None
fr: Aucun

source: Node Type
fr: Type de noeud

source: Save Workflow Mapping
fr: Sauvegarder la mise en relation du flux de travail

source: Actions
fr: activités

source: remove
fr: supprimer

source: Add
fr: Ajouter

source: Deleted workflow
fr: Flux de travail supprimé.

source: administer workflow
fr: administrer flux de travail
